app/views/students/new.html.erb

SELECT "standards".* FROM "standards"
---
								<%= f.label :standard, class:"form-control"%>
								<%=f.select :standard_id, Standard.all.collect {|std| [std.standard,std.id]}, class:"form-control"%>

SELECT "subjects".* FROM "subjects"
---
								<%= f.fields_for @results do |subj|%>
								<%= subj.select :subject_id, Subject.all.collect{|subj| [subj.name,subj.id]}, class:"form-control"%>

SELECT "subjects".* FROM "subjects"
---
							<%= f.fields_for @results do |subj|%>
							<%= subj.select :subject_id, Subject.all.collect{|subj| [subj.name,subj.id]}, class:"form-control"%>

SELECT "subjects".* FROM "subjects"
---
							<%= f.fields_for @results do |subj|%>
							<%= subj.select :subject_id, Subject.all.collect{|subj| [subj.name,subj.id]}, class:"form-control"%>