app/controllers/search_controller.rb

	def results
		@students = Student.where('name LIKE ?',"%#{params[:q]}%")
---
SELECT "students".* FROM "students" WHERE "students"."name" = $1  [["name", "Tanvi Garud"]]