app/controllers/students_controller.rb

	def show
		@results = Result.all
		@student = Student.find(params[:id])
---
SELECT "results".* FROM "results" WHERE "results"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]